<template>
  <div class="settings_container">
    <h4>Составление словарей</h4>
    <p>
      Добавление происходит по клику на кнопку или при нажатии
      <code>Enter</code>. Нажатие <code>Enter</code> в поле "Новое слово" только
      передвигает фокус на поле "Перевод". Встроенная транслитерация позволяет
      не переключать раскладку, но работает она только в переводе с английской
      на русскую.
    </p>
    <p>Несколько слов перевода необходимо разделять запятой.</p>
    <p>Автоматически составляется (и дополняется) обратный словарь.</p>
    <h4>Процесс повторения слов</h4>
    <p>
      На каждом шаге приложение показывает слово из словаря. Перевод
      показывается по клику на соответствующем поле. Кнопка
      <em>"ужасно"</em> оставит слово в текущей сессии, оно покажется снова.
      Кнопка <em>"плохо"</em> отложит следующий показ на 9 часов. Кнопка
      <em>"хорошо"</em> - на 2,5 дня. <em>"Отлично"</em> удалит слово из
      словаря.
    </p>
    <p>
      <strong>Управление с клавиатуры:</strong> <em>"пробел"</em> - показать
      перевод, <em>"Enter"</em> - удалить слово, <em>"Backspace"</em> -
      повторить еще раз, <em>клавиша b</em> - аналог нажатия кнопки "плохо",
      <em>клавиша g</em> - аналог кнопки "хорошо".
    </p>
    <h4>Хранение словарей</h4>
    <p>
      Словари хранятся в браузере, в хранилище indexedDB. При удалении файлов
      браузера, его смене и т.п. текущие словари доступны не будут. Но есть
      возможность экспортировать их в файл и импортировать в другом браузере
      (кнопки внизу). Существующие словари перезапишутся!
    </p>
    <p>
      Удаление пока не предусмотрено. Можно зайти в DevTools (F12), во вкладке
      Application выбрать IndexedDB, выбрать базу 'keepInMindWordsDictionary' и
      удалить ее, либо удалить отдельные словари в хранилище базы.
    </p>
    <import-export-buttons-component />
  </div>
</template>

<script>
import ImportExportButtonsComponent from "./ImportExportButtonsComponent.vue";
export default {
  components: {
    ImportExportButtonsComponent,
  },
};
</script>